backend/controllers/DeliveryRawMaterialController.php

    public function actionCreate()
    {
        $model = new DeliveryRawMaterial();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `delivery_raw_material` (`date`, `supplier_company_name`, `raw_material_name`, `is_packaging_ok`, `batch_no`, `expiration_date`, `unit`, `total_units`, `price_per_unit`) VALUES ('2023-09-22', 'test supplier ', 'test', '1', 'test', '2023-09-29', 'test', 'test', 'test')

    protected function findModel($delivery_raw_id)
    {
        if (($model = DeliveryRawMaterial::findOne(['delivery_raw_id' => $delivery_raw_id])) !== null) {
---
SELECT * FROM `delivery_raw_material` WHERE `delivery_raw_id`='1'