backend/controllers/ManagerController.php

    public function actionCreate()
    {
        $model = new Manager();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `manager` (`first_name`, `last_name`, `email`, `phone`) VALUES ('test', 'test', 'test', 'test')

    protected function findModel($manager_id)
    {
        if (($model = Manager::findOne(['manager_id' => $manager_id])) !== null) {
---
SELECT * FROM `manager` WHERE `manager_id`='1'