backend/controllers/OrderItemsController.php

    public function actionCreate($order_id)
    {
        $order = Order::findOne($order_id);

        if (!$order) {
            throw new NotFoundHttpException('Order not found.');
        }

        $model = new OrderItems();
        $model->order_id = $order_id;

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
SELECT * FROM `order` WHERE `order_id`='305'
SELECT EXISTS(SELECT * FROM `order` WHERE `order`.`order_id`='305')
INSERT INTO `order_items` (`order_id`, `product`, `var_rate`, `quantity`, `unit_price`) VALUES (305, '305', NULL, NULL, NULL)

    public function actionGeneratePdf($order_id)
    {
        $orderModel = Order::findOne($order_id);
---
SELECT * FROM `order` WHERE `order_id`='306'