backend/controllers/OrderController.php

    public function actionCreate($customer_id = null)
    {
        if ($customer_id !== null) {
            // Try to find an existing customer
            $customer = Customer::findOne($customer_id);

            if ($customer) {
                // Populate order attributes from the customer
                $order = new Order();

                $order->invoice_number = $this->generateInvoiceNumber();
                $order->date = date('Y-m-d H:i:s');

                $order->customer_id = $customer_id;
                $order->company_name = $customer->company_name;
                $order->street_name = $customer->i_street_name;
                $order->house_number = $customer->i_house_number;
                $order->appendix = $customer->i_appendix;
                $order->zipcode = $customer->i_zipcode;
                $order->city = $customer->i_city;
                $order->country = $customer->i_country;
                $order->vat_number = $customer->vat_number;

                // Save the order and redirect to order items create action
                if ($order->save()) {
---
SELECT * FROM `customer` WHERE `customer_id`='3'
INSERT INTO `order` (`invoice_number`, `date`, `customer_id`, `company_name`, `street_name`, `house_number`, `appendix`, `zipcode`, `city`, `country`, `vat_number`) VALUES (9869, '2023-09-26 11:19:01', 3, 'test', 'test', 'test', 'test', 'test', 'test', 'test', 'test')

    private function generateInvoiceNumber()
    {
        $existingNumbers = Order::find()->select('invoice_number')->column(); // Retrieve existing numbers
---
SELECT `invoice_number` FROM `order`

public function actionExistingCustomers()
{
    $customers = Customer::find()->all();
---
SELECT * FROM `customer`