backend/controllers/ProductRawController.php

    protected function findModel($product_raw_id)
    {
        if (($model = ProductRaw::findOne(['product_raw_id' => $product_raw_id])) !== null) {
---
SELECT * FROM `product_raw` WHERE `product_raw_id`='1'