backend/views/production-employees-work/_form.php

SELECT * FROM `production_employees`
---
/** @var yii\widgets\ActiveForm $form */


$employees = ProductionEmployees::find()->all();