common/models/SupplierRawMaterial.php

    public function getSupplierName()
    {
        // Check if supplier_id is set, and if so, fetch the corresponding supplier's name
        $supplier = Supplier::findOne($this->supplier_id);
---
SELECT * FROM `supplier` WHERE `supplier_id`=1