backend/views/production-batch/_form.php



// Fetch the list of employee names from the ProductionEmployees model
$employeeNames = ArrayHelper::map(ProductionEmployees::find()->all(), 'employees_id', function($model) {
    return $model->first_name . ' ' . $model->last_name;
});
---
SELECT * FROM `production_employees`