backend/views/supplier-raw-material/_form.php

/** @var yii\web\View $this */
/** @var common\models\SupplierRawMaterial $model */
/** @var yii\widgets\ActiveForm $form */
$supplierNames = ArrayHelper::map(Supplier::find()->all(), 'supplier_id', 'company_name');
---
SELECT * FROM `supplier`