backend/views/order/existing-customers.php

SELECT * FROM `order` WHERE `customer_id`=3
---
                'template' => '{create-order}',
                'buttons' => [
                    'create-order' => function ($url, $model, $key) {
                        $order = $model->orders ? $model->orders[0]->order_id : null;