backend/views/order/index.php

            'date',
            'invoice_number',
            'company_name',
            'street_name',
            //'house_number',
            //'appendix',
            //'zipcode',
            //'city',
            //'country',
            //'vat_number',
            //'discount',
            //'products',
            //'quantity',
            //'unit_price',
            //'sub_total',
            //'total',
            [
                'class' => ActionColumn::className(),
                'urlCreator' => function ($action, Order $model, $key, $index, $column) {
                    return Url::toRoute([$action, 'order_id' => $model->order_id]);
                 }
            ],
        ],
    ]); ?>
---
SELECT COUNT(*) FROM `order`