backend/views/delivery-raw-material/_form.php

SELECT * FROM `supplier`
SELECT * FROM `supplier_raw_material`
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'supplier_company_name')->dropDownList(
    \yii\helpers\ArrayHelper::map(\common\models\Supplier::find()->all(), 'company_name', 'company_name'),
    ['prompt' => 'Select Supplier']
) ?>

<?= $form->field($model, 'raw_material_name')->dropDownList(
    \yii\helpers\ArrayHelper::map(\common\models\SupplierRawMaterial::find()->all(), 'raw_material_name', 'raw_material_name'),
    ['prompt' => 'Select Raw Material']
) ?>